{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_140", "trainable": true, "batch_input_shape": [null, 1, 4, 70], "input_dtype": "float32", "nb_filter": 128, "nb_row": 4, "nb_col": 17, "init": "glorot_uniform", "activation": "relu", "border_mode": "valid", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_100", "trainable": true, "p": 0.15}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_141", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 17, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_101", "trainable": true, "p": 0.15}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_142", "trainable": true, "nb_filter": 128, "nb_row": 1, "nb_col": 17, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true}}, {"class_name": "Dropout", "config": {"name": "dropout_102", "trainable": true, "p": 0.15}}, {"class_name": "Flatten", "config": {"name": "flatten_52", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_135", "trainable": true, "output_dim": 128, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 6912}}, {"class_name": "Dense", "config": {"name": "dense_136", "trainable": true, "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 128}}], "keras_version": "1.2.2"}